// ? Завдання 1--------------------------------------------------------------------------------------------
// const number = prompt("Enter Number");

// Number(number) === 10 ? alert("вірно") : alert("не вірно");
// ----2й варіонат-------------------------------------------------------------------------------------------
// if (Number(number) === 10) {
//   alert("вірно");
// } else {
//   alert("невірно");
// }
// *---------------------------------------------------------------------------------------------------------
// ? Завдання 2---------------------------------------------------------------------------------------------

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// if (min <= 15) {
//   alert(`${min} входить в першу чверть`);
// } else if (min <= 30) {
//   alert(`${min} входить в другу чверть`);
// } else if (min <= 45) {
//   alert(`${min} входить в третю чверть`);
// } else {
//   alert(`${min} входить в четверту чверть`);
// }
// *---------------------------------------------------------------------------------------------------------
// ? Завдання 3---------------------------------------------------------------------------------------------

// const num = prompt("введи число від 1 до 4");

// switch (Number(num)) {
//   case 1:
//     alert("зима");
//     break;
//   case 2:
//     alert("весна");
//     break;
//   case 3:
//     alert("літо");
//     break;
//   case 4:
//     alert("осінь");
//     break;
//   default:
//     alert("Вибачте, але ви маєте ввести значення від 1 до 4 включно");
//     break;
// }
// *---------------------------------------------------------------------------------------------------------
// ? Завдання 4---------------------------------------------------------------------------------------------

// const totalMinutes = prompt("введи число");
// function formatTime(totalMinutes) {
//   const hours = Math.floor(totalMinutes / 60);
//   const min = totalMinutes % 60;
//   const zeroHours = String(hours).padStart(2, "0");
//   const zeroMin = String(min).padStart(2, "0");
//   return `${zeroHours}:${zeroMin}`;
// }

// alert(formatTime(totalMinutes));
// *---------------------------------------------------------------------------------------------------------
// ? Завдання 5---------------------------------------------------------------------------------------------

// const userName = prompt("введіть Login");
// let userPass;
// if (userName === "Адмін") {
//   userPass = prompt("введіть Pass");
//   if (userPass === "" || userPass === null) {
//     alert("Скасовано");
//   } else if (userPass === "Я головний") {
//     alert("Добрий день!");
//   } else {
//     alert("Невірний пароль!");
//   }
// } else {
//   alert("Я вас не знаю");
// }

// *---------------------------------------------------------------------------------------------------------
// ? Завдання 6---------------------------------------------------------------------------------------------

// let num = 0;

// while (num <= 20) {
//   console.log(num);
//   num++;
// }

// *---------------------------------------------------------------------------------------------------------
// ? Завдання 7---------------------------------------------------------------------------------------------

// function getNumbers(min, max) {
//   let sum = 0;
//   for (let i = max; i >= min; i--) {
//     console.log(i);
//     if (i % 2 === 0) {
//       sum += i;
//     }
//   }
//   return sum;
// }

// const total = getNumbers(1, 5);
// console.log(total);

// *---------------------------------------------------------------------------------------------------------
// ? Завдання 8---------------------------------------------------------------------------------------------

// function min(a, b) {
//   if (typeof a !== "number" || typeof b !== "number") {
//     return "Not a number!";
//   }
//   return a < b ? a : b;
// }

// *---------------------------------------------------------------------------------------------------------
// ? Завдання 9---------------------------------------------------------------------------------------------

// const age = prompt("Введіть ваш вік");

// function isAdult(age) {
//   if (age >= 18) {
//     return "true";
//   } else {
//     return confirm("Підтвердіть вік");
//   }
// }
// console.log(isAdult(age));
// confirm();

// *---------------------------------------------------------------------------------------------------------
// ? Завдання 10---------------------------------------------------------------------------------------------

// function fizzBuzz(num) {
//   for (let i = 1; i < num; i++) {
//     if (i % 3 === 0 && i % 5 === 0) {
//       console.log("fizzbuzz");
//     } else if (i % 3 === 0) {
//       console.log("fizz");
//     } else if (i % 5 === 0) {
//       console.log("buzz");
//     } else {
//       console.log(i);
//     }
//   }
// }
// fizzBuzz(15);
